# формируем список числовых признаков
num_features = [
    'Стаж клиента',
    'Ежемесячные платежи',
    'Совокупные платежи за всё время',
    'Пожилой клиент'
]

# формируем список бинарных признаков
cat_binary_features = [
    'пол',
    'Наличие супруга(и)',
    'Иждивенцы',
    'Наличие телефонной связи',
    'Электронный счёт'
]

# формируем список многозначных признаков
cat_multiclass_features = [
    'Несколько телефонных линий',
    'Тип интернет-подключения',
    'Онлайн-защита',
    'Онлайн-резервное копирование',
    'Защита устройств',
    'Техническая поддержка',
    'Стриминговое телевидение',
    'Стриминг фильмов',
    'Тип контракта',
    'Способ оплаты'
]
